hackathon/src/Documents/РаботаПоОбращению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РаботаПоОбращению</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТрудозатратрыОбращений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

hackathon/src/CommonForms/ВводЧасов/Module.bsl
&НаКлиенте
Процедура Принять(Команда)
	
	ПринятьНаСервере();  
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПринятьНаСервере()
	
	Если Регистратор = Документы.РаботаПоОбращению.ПустаяСсылка() Тогда
		
		НовДок = Документы.РаботаПоОбращению.СоздатьДокумент();
		НовДок.Обращение = Обращение;
		НовДок.Исполнитель = Исполнитель;
		НовДок.Часы = Часы;
		НовДок.ДатаРабот = ДатаРабот;
		НовДок.Комментарий = Комментарий;     
		НовДок.Дата = ТекущаяДатаСеанса();
		НовДок.Записать(РежимЗаписиДокумента.Проведение);
		
	Иначе
		
		НовДок = Регистратор.ПолучитьОбъект();
		НовДок.Обращение = Обращение;
		НовДок.Исполнитель = Исполнитель;
		НовДок.Часы = Часы;
		НовДок.ДатаРабот = ДатаРабот;
		НовДок.Комментарий = Комментарий;     
		НовДок.Дата = ТекущаяДатаСеанса();
		НовДок.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Обращение = Параметры.Обращение;
	
	Если Параметры.Свойство("Регистратор") Тогда 
		
		Регистратор = Параметры.Регистратор;
		НовДок = Регистратор.ПолучитьОбъект();
		Исполнитель = НовДок.Исполнитель;
		Часы = НовДок.Часы;
		ДатаРабот = НовДок.ДатаРабот;
		Комментарий = НовДок.Комментарий;     
		ДатаРабот = НовДок.ДатаРабот;
		
	КонецЕсли;
	
КонецПроцедуры
